#등급(수우미양가)

dct = {}

dct['학번'] = input("학번을 입력하시오")
dct['이름'] = input("이름을 입력하시오")
dct['국어'] = int(input("국어 성적을 입력하시오"))
dct['영어'] = int(input("영어 성적을 입력하시오"))
dct['수학'] = int(input("수학 성적을 입력하시오"))

dct['총점'] = (dct['국어'] + dct['영어'] + dct['수학'])
dct['평균'] = dct['총점']/3

if dct['평균'] >= 90:
    dct['등급'] = '수'
elif dct['평균'] >= 80:
    dct['등급'] = '우'
elif dct['평균'] >= 70:
    dct['등급'] = '미'
elif dct['평균'] >= 60:
    dct['등급'] = '양'
elif dct['평균'] < 60:
    dct['등급'] = '가'



print("            ***성적표***              ")
print("====================================")
print("학번 이름 국어 영어 수학 총점 평균 등급")
print("====================================")
print("%s %3s %2d %2d %2d %4d %2.2f %2s" %
      (dct['학번'], dct['이름'], dct['국어'], dct['영어'], dct['수학'], dct['총점'], dct['평균'], dct['등급']))
print("====================================")